STMicroelectronics/STM32CubeH7/Projects/STM32H750B-DK/Demonstrations/STemWin/Modules/audio_player/Config/audio_conf_template.h
/**
  ******************************************************************************
  * @file    audio_conf_template.h
  * @author  MCD Application Team
  * @brief   Audio processing configuration template file. 
  *          This file should be copied to the application folder and renamed
  *          to audio_conf.h.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2018 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __AUDIO_CONF_H_
#define __AUDIO_CONF_H_

/* Includes ------------------------------------------------------------------*/
/* Core Header file */
#if defined(STM32F4)
#include "stm32f4xx_hal.h"
#elif defined(STM32L4)
#include "stm32l4xx_hal.h"
#elif defined(STM32F7)
#include "stm32f7xx_hal.h"
#elif defined(STM32H7)
#include "stm32h7xx_hal.h"
#else
#error Unsupported Core!
#endif

/* Board Specific Audio Package Header file */
#if defined(USE_STM32469I_EVAL)
#include "stm32469i_eval_audio.h"
#elif defined(USE_STM32469I_DISCO) || defined(USE_STM32469I_DISCOVERY)
#include "stm32469i_discovery_audio.h"
#elif defined(USE_STM32769I_EVAL)
#include "stm32f769i_eval_audio.h"
#elif defined(USE_STM32769I_DISCO) || defined(USE_STM32769I_DISCOVERY)
#include "stm32f769i_discovery_audio.h"
#elif defined(USE_STM32L4R9I_EVAL)
#include "stm32l4r9i_eval_audio.h"
#elif defined(USE_STM32L4R9I_DISCO) || defined(USE_STM32L4R9I_DISCOVERY)
#include "stm32l4r9i_discovery_audio.h"
#elif defined(USE_STM32L496G_DISCO) || defined(USE_STM32L496G_DISCOVERY)
#include "stm32l496g_discovery_audio.h"
#elif defined(USE_STM32H747I_EVAL)
#include "stm32h747i_eval_audio.h"
#elif defined(USE_STM32H747I_DISCO) || defined(USE_STM32H747I_DISCOVERY)
#include "stm32h747i_discovery_audio.h"
#else
#error Unsupported Platform!
#endif

/* File System Header files */
#include "ff_gen_drv.h"
#include "usbh_diskio.h"

/** @addtogroup AUDIO_PLAYER
* @{
*/

/** @defgroup AUDIO_CONF_Template
* @brief Audio Player Configuration Template file
* @{
*/

#ifdef __cplusplus
 extern "C" {
#endif

/* Exported constants --------------------------------------------------------*/
/** @defgroup AUDIO_CONF_Exported_Constants
* @{
*/
/*-- Audio Decoder Codecs Support --*/
#define __WAV_DECODER__
/* #define __MP3_DECODER__ */   /* uncomment this to enable MP3 audio decode support. This Support not yet fully tested and validated! */
/* #define __AVI_DECODER__ */   /* uncomment this to enable AVI audio decode support. This Support not yet fully tested and validated! */

/*-- Specify "malloc" function to be used by the Player to allocate memory region --*/
#ifndef PLAYER_MALLOC
#define PLAYER_MALLOC(x)                pvPortMalloc(x)
#endif /* PLAYER_MALLOC */

/*-- Specify "free" function to be used by Player to release, previously, allocated memory region --*/
#ifndef PLAYER_FREE
#define PLAYER_FREE(x)                  vPortFree(x)
#endif /* PLAYER_FREE */

/*-- Audio Pack size : use default value defined in coders.h header file --*/
/* #define MAX_OUT_DEFAULT_PACKET_SZE                     (uint32_t)(1920*2*2) */       /* 1920 stereo samples in 16-bits*/

/*-- Static allocation for MP3 Decoder --*/
#ifdef __MP3_DECODER__
/* #define AUDIO_CODEC_MP3_STATIC_ALLOC */      /* Enable Static memory allocation for MP3 Decoder */
#endif /* __MP3_DECODER__ */

/*-- Static allocation for AVI Decoder --*/
#ifdef __AVI_DECODER__
#define AUDIO_CODEC_AVI_STATIC_ALLOC    /* Enable Static memory allocation for AVI Decoder */ /* This should be enabled until having final fix for memory leak issue */
#endif /* __AVI_DECODER__ */

/*+++++++++++++++++++++ AUDIO PLAYER Constants +++++++++++++++++++++++++++++++*/
/*-- Default Audio Player Volume */
#define AUDIO_PLAYER_DEFAULT_VOLUME   50

/*-- Audio Volume Backup Register --*/
#define AUDIO_PLAYER_BKP_REG          RTC_BKP_DR0
#define AUDIO_PLAYER_EQU1_BKP         RTC_BKP_DR1
#define AUDIO_PLAYER_EQU2_BKP         RTC_BKP_DR2
#define AUDIO_PLAYER_EQU3_BKP         RTC_BKP_DR3
#define AUDIO_PLAYER_EQU4_BKP         RTC_BKP_DR4
#define AUDIO_PLAYER_EQU5_BKP         RTC_BKP_DR5
#ifdef EQ_HIGH_QUALITY
#define AUDIO_PLAYER_EQU6_BKP         RTC_BKP_DR6
#define AUDIO_PLAYER_EQU7_BKP         RTC_BKP_DR7
#define AUDIO_PLAYER_EQU8_BKP         RTC_BKP_DR8
#define AUDIO_PLAYER_EQU9_BKP         RTC_BKP_DR9
#define AUDIO_PLAYER_EQU10_BKP        RTC_BKP_DR10
#endif /* EQ_HIGH_QUALITY */
#define AUDIO_PLAYER_LOUD_BKP         RTC_BKP_DR11

/* Audio Decoder thread stack size and priority */
#define AUDIO_DEC_THREAD_STACK_SIZE   (8 * configMINIMAL_STACK_SIZE)
#define AUDIO_DEC_THREAD_PRIORITY     osPriorityNormal

/* Audio Output thread stack size and priority */
#define AUDIO_OUT_THREAD_STACK_SIZE   (8 * configMINIMAL_STACK_SIZE)
#define AUDIO_OUT_THREAD_PRIORITY     osPriorityAboveNormal

/* Audio Player Algo configuration */
/* #define PLAYER_DISABLE_SRC */                /* Disable SRC Algo : for experimental usage */
/* #define PLAYER_DISABLE_SRC_ZERO_COPY */      /* Audio memory pool Zero Copy when SRC is disabled : for experimental usage */

/**
* @}
*/

/* Exported types ------------------------------------------------------------*/
/** @defgroup AUDIO_CONF_Exported_Types
* @{
*/
/**
 * @brief  Read Callback functions type
 */
typedef uint32_t (fnReadCallback_TypeDef)(
                                          void *       pCompressedData,             /* [OUT] Pointer to buffer to fill with coded MP3 data */
                                          uint32_t     nDataSizeInBytes,            /* Buffer size in Bytes */
                                          void *       pUser                        /* User pointer: can be used to pass additional parameters */
                                            );

typedef void (fnXFerCpltCallback_TypeDef)( uint8_t Direction,
                                          uint8_t** pbuf,
                                          uint32_t* pSize);

typedef uint32_t (fnSetPositionCallback_TypeDef)( void* pUser,
                                                 uint32_t Pos);

typedef void (fnUserCallback_TypeDef)( uint8_t* pBuff,
                                      uint32_t Size);

typedef void (fnEndOfFileCallback_TypeDef)(void);

typedef uint32_t (fnGetSizeCallback_TypeDef)( void* pUser);

/**
* @}
*/

/**
* @}
*/

/**
* @}
*/

#ifdef __cplusplus
}
#endif

#endif  /* __AUDIO_CONF_H_ */

